// 首页
"数据合伙人" = "Data Partner";
"音频数据" = "Audio Data";
"图片数据" = "Image Data";
"文本数据" = "Text Data";
"视频数据" = "Video Data";
"热门" = "Popular";
"音频" = "Audio";
"图片" = "Image";
"文本" = "Text";
"视频" = "Video";
"总资产" = "Total Assets";
"昨日收益" = "Yesterday's Earnings";
"我的收益" = "My Earnings";
"我的项目" = "My Projects";
"输入关键字/项目ID搜索" = "Enter Keyword/Project ID to Search";
"输入关键字搜索" = "Enter Keyword to Search";
"搜索" = "   Search   ";
"%@人参与" = "%@ Participants";
"剩%d名额/%d" = "%d spots left / %d";
"%ld条" = "%ld Items";

// 搜索页
"历史搜索" = "Search History";
"热门数据" = "Popular Data";

// 项目列表
"进行中" = "In Progress";
"待审核" = "Pending Review";
"未通过" = "Rejected";
"初审通过" = "Pre-Approved";
"已完成" = "Completed";
"正式数据" = "Official Data";
"测试数据" = "Test Data";
"PoID:%@ 已完成%d 共%d" = "PoID:%@ Completed %d of %d";

// 音频数据
"音频数据都在这里" = "All Audio Data";
"我的音频" = "My Audio";
"去管理 →" = "Manage →";
"全部" = "All";
"%@人录制" = "%@ Recordings";
"我能做什么" = "What Can I Do?";
"去加工 →" = "Process →";
"加工音频" = "Process Audio";

// 图片数据
"我的图片" = "My Images";
"图片数据都在这里" = "All Image Data";
"加工图片" = "Process Images";

// 文本数据
"我的文本" = "My Text";
"文本数据都在这里" = "All Text Data";
"参数：%@" = "Parameter: %@";

// 视频
"我的视频" = "My Videos";
"视频数据都在这里" = "All Video Data";
"加工视频" = "Process Videos";

// 项目详情
"+关注" = "+Follow";
"取消关注" = "Unfollow";
"项目介绍" = "Project Introduction";
"项目要求" = "Project Requirements";
"领取项目" = "Claim Project";
"参与项目" = "Join Project";
"查看项目" = "View Project";
"修正项目" = "Revise Project";
"开始测试" = "Start Test";
"等待审核" = "Pending Review";
"操作成功" = "Operation Successful";
"确定要取消关注吗?" = "Are you sure you want to unfollow?";
"项目流程" = "Project Process";
"完成测试数据" = "Test data completed";
"测试通过" = "Test passed";
"完成正式数据" = "Official data completed";
"初审通过" = "Preliminary review passed";
"终审通过" = "Final review passed";
"待支付" = "Pending payment";
"已支付" = "Paid";
// 项目题目
"未通过原因：%@" = "Rejection Reason: %@";
"查看要求" = "View Requirements";
"阅读图片要求" = "Read Image Requirements";
"输入文本内容" = "Enter Text Content";
"阅读文本要求" = "Read Text Requirements";
"Step%ld：确认数据" = "Step%ld: Confirm Data";
"文件上传失败" = "File Upload Failed";
"加载中..." = "Loading...";
"样例" = "Sample";
"Step1：阅读文本要求" = "Step1: Read Text Requirements";
"格式不支持" = "Unsupported Format";
"Step1：阅读视频要求" = "Step1: Read Video Requirements";
"Step3：输入文本内容" = "Step3: Enter Text Content";
"部分视频下载失败" = "Partial Video Download Failed";
"部分视频导出失败" = "Partial Video Export Failed";
"需上传%ld个视频" = "Need to Upload %ld Videos";
"需再上传%ld个视频" = "Need to Upload %ld More Videos";
"上传成功" = "Upload Successful";
"需上传%ld张图片" = "Need to Upload %ld Images";
"需再上传%ld张图片" = "Need to Upload %ld More Images";
"视频（%lu/%lu）" = "Videos (%lu/%lu)";
"图片（%lu/%lu）" = "Images (%lu/%lu)";
"Step2：输入或上传文本" = "Step2: Enter or Upload Text";
"下一条" = "Next";
"上一条" = "Previous";
"Step3：确认数据" = "Step3: Confirm Data";
"Step5：确认数据" = "Step5: Confirm Data";
"录制下一条" = "Record Next";
"完成" = "Complete";
"保存" = "Save";
"Step2：开始拍摄或上传视频和图片" = "Step2: Start Shooting or Uploading Videos & Images";
"%ld/%ld条" = "%ld/%ld Items";
"Step2：输入文本内容" = "Step2: Enter Text Content";
"Step2：输入文本" = "Step2: Enter Text";
"请输入文本标题..." = "Enter Text Title...";
"请输入文本内容..." = "Enter Text Content...";
"本地上传" = "Local Upload";
"当前题目数据为空！" = "No Data Available for Current Task!";
"PoID:%@" = "PoID:%@";
"图片（%lu/%ld）" = "Images (%lu/%ld)";
"请先录制声音" = "Please Record Audio First";
"请在\"设置－Mobiwusi\"中打开麦克风权限" = "Please Enable Microphone Permission in Settings → Mobiwusi";
"去设置" = "Go to Settings";
"请输入文本内容" = "Please Enter Text Content";
"当前音量过小，请调大音量后播放" = "Volume Too Low. Please Increase Volume to Play.";
"已过滤不支持的格式" = "Unsupported formats have been filtered out";
"保持静音，录音处理中" = "Keep silent. The audio recording is being processed.";
// 消息列表
"消息" = "Messages";

// 我的数据
"我的数据" = "My Data";
"音频参数：%@" = "Audio Parameters: %@";
"刷新" = "Refresh";
// 提现
"   提现   " = "   Withdraw   ";
"yyyy年MM月" = "yyyy-MM";
"收益%@ 提现%@" = "Earnings %@ | Withdraw %@";
"余额不足" = "Insufficient balance.";
"请填写银行卡卡号" = "Enter Bank Card Number";
"请填写开户行" = "Enter Bank Name";
"￥" = "$";
"审核中" = "In Review";
"打款中" = "Processing Payout";
"已打款" = "Payout Completed";
"审核失败" = "Review Failed";
"打款失败" = "Payout Failed";
"你还未绑定支付宝，绑定后才可以提现到支付宝" = "You haven't bound Alipay yet. You can only withdraw money to Alipay after binding it.";
"提现" = "Withdraw";
"当前余额 (元)" = "Current Balance (￥)";
"提现金额" = "Withdrawal Amount";
"选择提现方式" = "Select Withdrawal Method";
"银行卡" = "Bank Card";
"立即提现" = "Withdraw Now";
"申请成功！" = "The application was successful!";
"推荐" = "Recommendation";

// 我的标签
"已拥有" = "Owned";
"未拥有" = "Not Owned";

// 收益提醒
"恭喜您！" = "Congratulations!";
"您的数据收益已到账！" = "Your Data Earnings Have Been Credited!";
"项目新增收益" = "New Project Earnings";
"收益已存入资产可提现" = "Earnings Deposited – Ready to Withdraw";
"查看详情" = "View Details";
"开心收下" = "Accept";
"%@年%@月" = "%@-%@";
"取消" = "Cancel";
"确定" = "Confirm";
"提现记录" = "   Withdrawal History   ";

// 意见反馈
"请在此输入详细问题或意见" = "Enter Detailed Issue or Feedback";
"请先输入详细问题或意见！" = "Please Enter Detailed Issue or Feedback First!";
"请先输入您的联系方式" = "Please Enter Your Contact Information First";
"感谢您的反馈！" = "Thank You for Your Feedback!";
"上传头像失败" = "Profile Picture Upload Failed";

// 网页标题（法律条款，带《》）
"用户服务协议与隐私政策提示" = "User Service Agreement & Privacy Policy Notice";
"请在使用前查阅" = "Please Review Before Use";
"《用户协议》" = "《User Agreement》";          // 标题（带《》）
"和" = "and";
"《隐私政策》" = "《Privacy Policy》";          // 标题（带《》）
"并充分了解以下信息/权限申请情况：当您需要上传图片、拍摄功能时，我们会申请获取您的摄像头，读取存储的权限。当您在更新版本时，我们会申请获取您的存储以及软件安装的权限。" = "Please also review the following permissions: Camera and storage access for image uploads/captures. Storage and installation permissions for app updates.";
"不同意并退出" = "Decline & Exit";
"同意并继续" = "Accept & Continue";

// 普通文本（不带《》，独立键）
"隐私政策" = "Privacy Policy";                // 普通文本
"用户协议" = "User Agreement";                // 普通文本

// 登录（带《》- 标题）
"密码登录" = "Password Login";
"验证码登录" = "Verification Code Login";
"请先阅读并同意《用户协议》及《隐私协议》" = "Please read and accept 《User Agreement》 & 《Privacy Policy》 first.";// 标题（带《》）
"请输入手机号" = "Enter Phone Number";
"请输入合法的手机号！" = "Enter a Valid Phone Number!";
"已发送" = "Get Verification Code";
"请输入手机号!" = "Enter Phone Number!";
"请输入密码" = "Enter Password";
"请输入验证码" = "Enter Verification Code";
"登录成功" = "Login Successful";
"没有账号，" = "No Account? ";
"去注册" = "Sign Up";
"忘记密码" = "Forgot Password";
"《隐私协议》" = "《Privacy Policy》";          // 标题（带《》，修正遗漏）

// 个人中心
"修改昵称" = "Change Nickname";
"请输入昵称（不超过8个字）" = "Enter Nickname (Max 8 Characters)";
"修改成功" = "Nickname Changed Successfully";
"修改失败" = "Nickname Change Failed";
"温馨提示" = "Reminder";
"确定要清理缓存吗？" = "Confirm Cache Clear?";
"缓存已清理完成" = "Cache Cleared";
"确定要退出登录吗？" = "Confirm Logout?";
"注销用户" = "Delete Account";
"请确认您的账户下是否有未完成的任务，待领取待提现的收益等，操作完成后可注销用户。" = "Ensure all tasks are completed and earnings are withdrawn before deleting your account.";
"我再想想" = "Cancel";
"确认注销" = "Confirm Delete";
"再次确认注销账户" = "Final Confirmation: Delete Account";
"提交账户注销申请60天内，你仍可登录该账户(登录成功将终止注销流程，但你可重新申请注销):若超过60天未登录，你的账户将被注销且不可恢复，请谨慎操作。" = "You may log in within 60 days to cancel the deletion (reapply later). After 60 days, the account will be permanently deleted. Proceed with caution.";
"再想想" = "Cancel";
"确认注销" = "Confirm Delete";
"账号已注销" = "Account Deleted";
"升级提醒" = "Update Available";
"当前App有新版本是否立即升级" = "New Update Available. Update Now?";
"当前app已是最新版本" = "Already Up to Date";
"头像上传成功" = "Profile Picture Uploaded";
"上传头像失败" = "Profile Picture Upload Failed";
"复制" = "Copy";
"已复制" = "Copied";
"我的空间" = "My Space";
"个人中心" = "Profile";
"头像" = "Profile Picture";
"昵称" = "Nickname";
"账号" = "MoID";
"消息通知" = "Message Notification";
"联系我们" = "Contact Us";
"mobiwusi用户反馈" = "Mobiwusi User Feedback";
"意见反馈" = "Feedback";
"APP备案号" = "APP Filing Number";
"清理缓存" = "Clear Cache";
"浙ICP备2024117967号-2A" = "Zhejiang ICP Filing No. 2024117967-2A";
"注销账户" = "Delete Account";
"检测更新" = "Check for Updates";
"退出登录" = "Logout";
// 登录管理相关
"登录管理" = "Login Management";
"微信" = "WeChat";
"支付宝" = "Alipay";
"苹果账号" = "Apple Account";
"已绑定" = "Already Bound";
"去绑定" = "Go to Bind";
"确定要解绑吗" = "Are you sure you want to unbind?";
"解绑成功！" = "Unbinding Succeeded!";
"绑定成功！" = "Binding Succeeded!";
"确定要解除绑定吗？解绑后将无法继续使用该微信登录本账号" = "Are you sure you want to unbind? You won't be able to use this WeChat account to log in to this account after unbinding.";
"确定要解除绑定吗？解绑后将无法继续使用该支付宝登录本账号" = "Are you sure you want to unbind? You won't be able to use this Alipay account to log in to this account after unbinding.";
"确定要解除绑定吗？解绑后将无法继续使用该苹果账户登录本账号" = "Are you sure you want to unbind? You won't be able to use this Apple ID to log in to this account after unbinding.";

"确定要解除绑定吗？" = "Are you sure you want to unbind?";
"解绑后将无法继续使用该微信登录本账号" = "After unbinding, you will no longer be able to use WeChat to log in to this account.";
"解绑后将无法继续使用该支付宝登录本账号" = "After unbinding, you will no longer be able to use Alipay to log in to this account.";
"解绑后将无法继续使用该苹果账户登录本账号" = "After unbinding, you will no longer be able to use the Apple account to log in to this account.";
"绑定微信" = "Bind WeChat";
"绑定支付宝" = "Bind Alipay";
"绑定苹果账号" = "Bind Apple account";
"已向绑定手机" = "Has sent a verification text message to the bound mobile phone";
"，发送了一条验证短信" = ", and a verification SMS has been sent.";
"解除绑定" = "Unbind";
"短信验证码不能为空" = "The SMS verification code cannot be empty.";
//选择国家和地区
"选择国家和地区" = "Select Country and Region";

// 绑定手机号相关
"绑定手机号" = "Bind Phone Number";
"立即绑定" = "Bind Now";
// 注册（带《》- 标题）
"获取验证码" = "Get Verification Code";
"请输入登录密码" = "Enter Login Password";
"密码必须6-16 位，必须包含大小写字母、数字、特殊字符" = "Password must be 6–16 characters, including uppercase/lowercase letters, numbers, and special characters.";
"请输入再次输入登录密码" = "Re-enter Password";
"两次输入的密码不一致" = "Passwords Do Not Match";
"请阅读并同意《用户协议》和《隐私政策》" = "Read and Accept 《User Agreement》 and 《Privacy Policy》"; // 标题（带《》）
"注册成功!" = "Registration Successful!";
"注册账号" = "Create Account";
"密码必须包含大小写字母、数字、特殊字符，6-16位" = "Password: 6–16 characters (letters, numbers, special characters)";
"请再次输入登录密码" = "Re-enter Password";
"我已阅读并同意" = "I Accept";
"及" = "and";
"立即注册" = "Sign Up Now";
"已有账号，" = "Already Have an Account? ";
"去登录" = "Login";


// 忘记密码
"两次输入的密码不一致" = "Passwords Do Not Match";
"修改成功!" = "Password Changed!";
"完成并登录" = "Finish & Login";

// 法律条款独立键（带《》）
"《隐私协议》" = "《Privacy Policy》";          // 修正遗漏，标题（带《》）
"《用户协议》" = "《User Agreement》";          // 标题（带《》）

// 普通文本场景（不带《》）
"查看用户协议" = "View User Agreement";        // 普通文本
"查看隐私政策" = "View Privacy Policy";        // 普通文本

//修改密码
"为了您的账号安全，需要验证您的手机号：" = "For the security of your account, we need to verify your mobile phone number: ";
"请输入新密码" = "Please enter the new password.";
"请再次输入新密码" = "Please enter the new password again.";
"修改密码" = "Modify Password";
"立即修改" = "Modify Now";

//数据合伙人
"积分规则" = "Point Rules";
"当前等级" = "Current Level";
"签到赚积分" = "Earn Points by Signing In";
"  Mobi分：%d/%d" = "  Mobi Points：%d/%d";
"已连续签到%d天" = "Continuously signed in for %d days";
"今天" = "Today";
"补签" = "Backdate Sign-In";
"Mobi分" = "Mobi Points";
"去完成" = "Go to Complete";
"已通过" = "Completed";
"认证" = "Certification";
"请拍摄您的毕业证书或学位证书" = "Please take a photo of your graduation certificate or degree certificate.";
"请确保证件边框完整、字体清晰、亮度均匀" = "Please ensure the document border is complete, the text is clear, and the brightness is even.";
"点击拍摄/上传" = "Tap to Capture/Upload";
"MOBIUSI将对信息智能加密，实时保障信息安全" = "MOBIUSI will intelligently encrypt information and ensure real-time information security.";
"上传失败" = "Upload Failed";
"上传认证" = "Upload Certification";

"工作认证" = "Employment Certification";
"工作类型" = "Employment Type";
"请选择你的工作类型" = "Please select your employment type";
"工作单位" = "Work Unit";
"请输入单位名称" = "Please enter the unit name";
"月收入区间" = "Monthly Income Range";
"选填" = "Optional";
"提交" = "Submit";
"请选择您的工作类型" = "Please select your employment type"; // 与上文合并，避免重复键名
"请选择您的月收入区间" = "Please select your monthly income range";
"请选择工作类型" = "Please select employment type";
"请选择月收入区间" = "Please select monthly income range";
"请输入工作单位" = "Please enter work unit";
"提交成功" = "Submission Successful";
"第1步：请拍摄您的驾驶证主页" = "Step 1: Please take a photo of the main page of your driver's license.";
"第2步：请拍摄您的驾驶证副页" = "Step 2: Please take a photo of the supplementary page of your driver's license.";
"请拍摄您的驾驶证主页" = "Please take a photo of the main page of your driver's license.";
"请拍摄您的驾驶证副页" = "Please take a photo of the supplementary page of your driver's license.";
"第1步：请拍摄您的身份证正面" = "Step 1: Please take a photo of the front side of your ID card.";
"第2步：请拍摄您的身份证反面" = "Step 2: Please take a photo of the back side of your ID card.";
"拍摄您的身份证正面" = "Take a photo of the front side of your ID card.";
"请拍摄您的身份证反面" = "Please take a photo of the back side of your ID card.";
"恭喜您！" = "Congratulations!";
"签到成功" = "Check-in Successful";
"恭喜您获得" = "Congratulations on earning";
"明天再来" = "Come back tomorrow";
//自由上传
"这一刻的想法..." = "Thoughts at this moment...";
"下一步" = "Next Step";
"请上传一个文件" = "Please upload a file";
"上传失败或者格式不支持" = "Upload failed or format not supported";
"导出失败" = "Export failed";
"录音时长不能低于5s" = "Recording duration must be at least 5s";
"点击录制" = "Tap to Record";
"重新录制" = "Re-record";
"录制完成，可点击试听" = "Recording completed. Tap to listen.";
"不显示位置" = "Location not displayed";
"每日任务：数据任务" = "Daily Tasks: Data Tasks";

"资讯分析师" = "Information Analyst"; // 保留品牌名，"总结"译为"Summary"
"处理中..." = "Processing...";
"处理失败" = "Processing Failed";
"已完成" = "Completed";
"全文摘要" = "Full Text Summary";
"参数" = "Parameters";
"标签" = "Tags";
"视频来源/链接" = "Video Source/Link";
"链接识别" = "Link Recognition";
"什么也不做，去上传" = "Do Nothing, Go to Upload"; // 直译，也可优化为"Proceed to Upload Without Action"
"稍后可在我的数据里查看总结进度" = "You can check the summary progress in My Data later.";
"上传成功,稍后可在我的数据里查看总结进度" = "Upload successful. You can check the summary progress in My Data later.";
"导图" = "Mind Map"; // "思维导图"的常见英文表述
"检测到您复制了视频或文章链接，是否要打开" = "Detected that you copied a video or article link. Do you want to open it?";
"开始解析" = "Start Parsing";

"采集项目" = "Collection Project";
"加工数据" = "Process Data";
"加工数据通过审核可得" = "Available upon approval of processed data";
"奖励" = "Reward";
"加工记录" = "Processing Record";
"加工中" = "Processing";
"未通过" = "Rejected";
"已完成" = "Completed";
"待审核" = "Pending Review";
"已回收" = "Recycled";

"存草稿" = "Save as Draft";
"完成" = "Complete";
"请先添加编辑片段" = "Please add editing segments first";
"提交成功" = "Submission Successful";
"保存成功" = "Saved Successfully";
"转译成功" = "Translation Successful";
"删除失败" = "Deletion Failed";
"删除成功" = "Deleted Successfully";
"音频属性" = "Audio Properties";
"准确填写音频属性，有机会获得更多加工数据奖励" = "Accurately fill in audio properties to get more rewards for processed data";
"音频标签" = "Audio Tags";
"准确添加音频标签，有机会获得更多加工数据奖励" = "Accurately add audio tags to get more rewards for processed data";
"加工详情" = "Processing Details";
"添加片段" = "Add Segment";
"已选时间" = "Selected Time";
"结束时间" = "End Time";
"请设置开始时间" = "Please set the start time";
"请设置结束时间" = "Please set the end time";
"截取时长不能为0" = "Segment duration cannot be 0";
"与已保存的音频区间有重合" = "Overlaps with existing audio segments";
"保存片段" = "Save Segment";
"开始时间" = "Start Time";
"设为开始" = "Set as Start";
"设为结束" = "Set as End";
" 片段%d " = " Segment %d ";
"音频是否有效" = "Is Audio Valid?";
"无效原因" = "Reason for Invalidity";
"点击此处进行音频备注操作" = "Click here to add audio notes";
"%d项待填写" = "%d items to be filled";
"音频转写" = "Audio Transcription";
"智能转写" = "Intelligent Transcription";
"点击此处可进行手动转写" = "Click here for manual transcription";
"添加标签" = "Add Tags";
"已添加%d个标签" = "%d tags added";
"备注" = "Notes";
"去加工" = "Go to Process";
"请先设置开始时间" = "Please set the start time first";
"结束时间不能小于开始时间" = "The end time cannot be earlier than the start time";


"总结示例" = "Summary Example";
"输入文本/URL" = "Enter Text/URL";
"你好！我是资讯分析员小助手" = "Hello! I am the Mobiwusi Summary Assistant";
"我能为你快速总结各种音频、图片、视频、文件中的关键信息，提取主要观点和摘要以及思维导图。" = "I can quickly summarize key information from various audios, images, videos, and files, extracting main points, summaries, and mind maps.";
"摘要总结" = "Summary";
"帮你快速总结数据核心，生成总结摘要" = "Help you quickly summarize the core of data and generate summary abstracts.";
"导图生成" = "Mind Map Generation";
"直观呈现思维脉络，生成结构化思维导图" = "Intuitively present the thinking context and generate a structured mind map.";
"标签：" = "Tags:";
"参数：" = "Parameters:";
"查看示例" = "View Example";
"开始识别" = "Start Recognition";
"请输入文本或者URL" = "Please enter text or URL";

"待修正" = "To be corrected";
// Localizable.strings (English)
"出国翻译官" = "Overseas Translator";
"翻译记录" = "Translation History";
"保存" = "Save";
"保存到相册" = "Save to Album";
"分享" = "Share";
"原文" = "Original";
"复制" = "Copy";
"已复制" = "Copied";
"译文" = "Translation";
"重拍" = "Retake";
"朋友圈" = "Moments";
"微信" = "WeChat";
"QQ空间" = "QQ Zone";
"复制链接" = "Copy Link";
"请在\"设置－Mobiwusi\"中打开相机权限" = "Please enable camera permission in \"Settings - Mobiwusi\".";
"请在\"设置－Mobiwusi\"中打开相册权限" = "Please enable photo library permission in \"Settings - Mobiwusi\".";


"音频属性配置异常" = "Audio attribute configuration exception";
"音频文件下载失败" = "Audio file download failed";
"多变摄影师" = "Versatile Photographer";
"详情" = "Details";
"好了通知我" = "Notify me when ready";
